# GetRotation Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarBendingDetail..::..GetRotation Method
RebarBendingDetail Class See Also
---
Gets the rotation angle in radians for the bending detail relative to its view.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static double GetRotation(
	Element bendingDetail
)
```

Visual Basic
---
```text
Public Shared Function GetRotation ( _
	bendingDetail As Element _
) As Double
```

Visual C++
---
```text
public:
static double GetRotation(
	Element^ bendingDetail
)
```

# ### Parameters
bendingDetail
    Type: Autodesk.Revit.DB..::..Element The bending detail for which we want to get the rotation.
# ### Return Value
Returns the rotation angle in radians for the bending detail relative to its view.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
RebarBendingDetail Class
Autodesk.Revit.DB.Structure Namespace